#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ba96189a-58e2-4e44-a6c0-a59a84eb5108]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0398d20a-087c-487a-b2f8-0d1034df4fbd]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2ed18f1f-5e16-4f43-9bed-d570cd81c4e7]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a0f6f4d5-d474-4f34-8d3e-2c002c404641]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=88df8f0b-f83a-4682-a79f-d71086f85938]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60ce28cd-df42-4c67-b3ec-6743b0024056]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e71eb3cf-2ccd-4664-b468-45e58cf494d7]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=01c24c73-a457-4c4c-8947-828af6b2f84c]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5158e07-c72a-4b1e-b720-12077d64b313]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3358f8e1-4227-4d14-a05e-8c6cf2c7a831]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=66632eee-9d95-4dcd-aee5-98b2694d66e1]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c82f9a2a-a572-4791-b133-f10f68ba410d]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1d2fc4dd-a017-4930-9728-34386b44b351]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c773ca7d-e754-4003-bc5e-cfe90c19c4ce]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b31286d0-02b1-4817-8050-77945247f967]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e3e15e97-426b-4cd8-83fe-32cdfc8e37d9]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f52e2b77-0da6-4e3f-a2ff-6f559c4e6c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4588592c-5cc4-4973-9655-d22d89a4003f]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4bce0ae4-8c9e-43b9-b6a2-81ab80d51283]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=22f63304-b712-4d6d-bbdc-69923ea03f83]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=abcbe85e-df8c-47ce-a7ab-d2a6a8dfe75e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=827fa47e-a277-4ca1-8f70-32efebfde745]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5aca37af-a5cf-4589-a5d4-500e31638bbe]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b603cd1d-36d0-4ee3-b92b-12d65a308112]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6c4f57b5-6814-4ac6-8466-25917eb885ac]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=961942f0-5d9b-4692-a24e-6588eca82a3f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1bed6e2e-ba8e-435c-994a-dd229a49f9d1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1228035e-160a-4059-be47-ad2fdd3f6d2a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5147dd4-259c-4487-bbbf-9b7ea87f314c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6151860d-1780-4ee4-b47e-d64b09795cc7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6db7451e-825e-48d2-a4be-9bf193295ada]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=033a953a-5dd6-472c-9a5c-8d5bff6df889]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c995a533-816a-48dd-9aa0-37e98c02bd17]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f73e5464-501c-49d4-bf8c-2802a8360926]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7c3e998a-8ae2-4d5d-a71e-6174d7e5f5c3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=41a127b0-5114-46c6-bea6-47c40ad6e18d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9d8510bc-7f2c-49ab-83a2-099dd23eaf99]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bc59ddfc-f011-43ac-bfb4-554d07506edc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d17dd5ab-c7e4-4ab9-b50d-433d2ab0db07]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=163a1516-6055-4249-90cb-8a0063a6f7de]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ed73078-f49e-4471-b56c-5313a5e461af]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb6f72bb-4325-433a-9579-261210291fc3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=67d6d396-9e6a-4904-a3c9-d8f1ff697235]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d97d4f3a-8a4c-4a1a-ad6f-0fed80f5d66c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d6026de8-3eee-4aba-a5fe-96a9bcfa0826]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cf92d72a-c9fa-49f5-921f-d152dc7e6ed7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6205b812-8af3-4df4-8e98-776289573bd4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=283ecfe9-1c7b-4a54-b6e9-a8c6c3f234be]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b226bb3a-643e-42f8-b270-eb8c81d737a0]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17b06bb4-7de4-4441-8737-675325c9d815]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=281222ef-5ba9-49d6-b755-d3337d7d9201]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=144504cf-24e8-4d75-981b-35dcb9dfa993]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c398ff2d-2227-4de0-ab41-60c9b3bcbf61]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c62521e1-f097-472c-9a75-edc089b7ecb6]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d35dfca4-2753-4423-9a4c-3114febab853]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=378a7ed3-7a7e-47a8-9ac3-dffd1077d14f]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=da9a081d-f876-4f6d-9ff7-229d5c4a4db7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f8477a8-9469-4178-8961-02ed2da74010]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b58a9e06-30b2-4fd9-a042-8d46d15ce7e3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75f152fc-ed9f-409d-bce8-0035c0d895c3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d5d2af1d-f1d8-4291-b46a-fe590bb3a2d7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a564a503-cd0e-4ecb-ad80-6345c90fefc6]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f32acbb7-bf93-4b76-a104-99d74df97f59]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=59b7ccff-ffa1-45fd-a2c4-a0db7d1cc454]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e41cb5-7782-4314-81ee-445364b0753c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=899ff4df-5513-47d9-9984-159efbad59ad]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3ad1d3b0-ee8d-4246-ba21-cd01d2786281]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=966222d7-7d28-4ad1-9f67-d9dda46754e4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a1d26907-f28d-4c71-ae7c-18474511b1e9]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=026e79a6-549b-4d4a-985f-ca82c23927a2]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=59cbefeb-ff9c-4125-82c9-e16cfb121a71]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=168fe5fb-b83d-41a3-8bd6-0d3bc997b4fb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d03ca8c0-076a-49ee-b9c7-c885a51fdc0d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f4290d21-f42e-402d-83da-abc8d4041fdb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=85fb3271-c5a0-4935-b423-937806e53af7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=41894bb2-7d48-4e42-aede-7f9d81df1c2a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=359103f8-356a-486c-90eb-6762f3602af2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=82621594-063a-4fda-b4af-5070134fe34a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aed0b740-b941-41c7-bc57-3ed4b965c72e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=46755eb2-0df6-4bfe-b2ce-3e7c891312ff]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4fcc052b-d3e3-4515-ab43-c0f74b0d3d45]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1cbd40db-e353-40a4-a860-fad0423eb01a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbcd40f7-b57e-448b-9668-93bed4daf83f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5fbabd38-1d26-44f9-8086-9b675782ebad]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=59428ca5-75f7-40d4-bc3a-6c0cd359c321]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bfe0a642-272e-4dc6-bceb-c74311c94cef]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "testprojectjunmin-3367"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testprojectjunmin-3367"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "testprojectjunmin-3367"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testprojectjunmin-3367"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*